# Brewfile generated with the following command:
# brew bundle dump
#
# Taps
tap 'caskroom/cask'
#tap 'facebook/fb'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/gui'
#tap 'jasonmp85/iwyu'
tap 'universal-ctags/universal-ctags'

# Install binaries
brew 'ack'
brew 'bashdb'
brew 'docbook'
brew 'asciidoc'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'openssl'
brew 'pkg-config'
brew 'gdbm'
brew 'sqlite'
brew 'python'
brew 'atk'
brew 'bash-completion'
brew 'batik'
brew 'bear'
brew 'binutils'
brew 'boost'
brew 'ccache'
brew 'chisel'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'cppcheck'
brew 'gmp'
brew 'mpfr'
brew 'gawk'
brew 'gnu-sed'
brew 'libelf'
brew 'wget'
brew 'docbook-xsl'
brew 'dwarfutils'
brew 'isl'
brew 'jpeg'
brew 'gd'
brew 'gdb'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'gnome-icon-theme'
brew 'gnu-getopt'
brew 'lua'
brew 'gnuplot'
brew 'libunistring'
brew 'nettle'
brew 'gnutls'
brew 'libtool'
brew 'graphviz'
brew 'grep', args: ['with-default-names']
brew 'gsettings-desktop-schemas'
brew 'icu4c'
brew 'hicolor-icon-theme'
brew 'gtk+'
brew 'xz'
brew 'gtkglext'
brew 'gtksourceview3'
brew 'help2man'
brew 'imagemagick'
brew 'libcroco'
brew 'librsvg'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'nvim'
brew 'open-scene-graph'
brew 'p7zip'
brew 'premake'
brew 'protobuf'
brew 'py2cairo'
brew 'pygobject3'
brew 'qt'
brew 'qcachegrind', args: ['with-graphviz']
brew 'qemu'
brew 'socat'
brew 'stgit'
brew 'stow'
brew 'the_silver_searcher'
brew 'tig'
brew 'vim', args: ['with-lua', 'with-python', 'with-client-server', 'with-override-system-vi']
brew 'xmlto'
brew 'zlib'
brew 'ccls'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']

# Apps
cask 'shiftit'
cask 'java'
cask 'xquartz'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Xcode', id: 497799835
mas 'Microsoft Remote Desktop', id: 715768417
