#Taps
tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/gui'
tap 'homebrew/science'
tap 'jasonmp85/iwyu'

# Install Bash 4
brew 'bash'

# Install binaries
brew 'ack'
brew 'docbook'
brew 'asciidoc'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'pkg-config'
brew 'gdbm'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'gobject-introspection'
brew 'atk'
brew 'bash-completion'
brew 'bear'
brew 'binutils'
brew 'boost'
brew 'ccache'
brew 'chisel'
brew 'cmake'
brew 'coreutils'
brew 'cppcheck'
brew 'gmp'
brew 'mpfr'
brew 'gawk'
brew 'gnu-sed'
brew 'libelf'
brew 'wget'
brew 'crosstool-ng'
brew 'ctags'
brew 'docbook-xsl'
brew 'dwarfutils'
brew 'isl'
brew 'libmpc'
brew 'gcc'
brew 'jpeg'
brew 'libtiff'
brew 'webp'
brew 'gd'
brew 'gdb'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'glew'
brew 'gnome-icon-theme'
brew 'gnu-getopt'
brew 'lua'
brew 'gnuplot'
brew 'libtasn1'
brew 'libunistring'
brew 'nettle'
brew 'p11-kit'
brew 'gnutls'
brew 'sdl2'
brew 'sdl2_image'
brew 'gource'
brew 'libtool'
brew 'graphviz'
brew 'grep', args: ['with-default-names']
brew 'gsettings-desktop-schemas'
brew 'hicolor-icon-theme'
brew 'icu4c'
brew 'harfbuzz'
brew 'pango'
brew 'gtk+'
brew 'libepoxy'
brew 'gtk+3'
brew 'gtkglext'
brew 'gtksourceview3'
brew 'help2man'
brew 'libcroco'
brew 'libevent'
brew 'librsvg'
brew 'libssh2'
brew 'mackup'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'open-scene-graph'
brew 'p7zip'
brew 'premake'
brew 'protobuf'
brew 'py2cairo'
brew 'pygobject3'
brew 'qemu'
brew 'qt5'
brew 'rust'
brew 'socat'
brew 'stgit'
brew 'xz'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'xmlto'
brew 'zlib'
brew 'homebrew/science/r'
brew 'jasonmp85/iwyu/iwyu'


# Apps
cask 'xquartz'
cask 'kdiff3'
cask 'araxis-merge'

# Install Mac App Store apps
mas '1Password', id: 443987910
